{
  "activation": "gelu",
  "architectures": ["DistilBertForSequenceClassification"],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,

  "id2label": {
    "0": "No Risk",
    "1": "Mild Risk",
    "2": "Moderate Risk",
    "3": "High Risk"
  },
  "label2id": {
    "No Risk": 0,
    "Mild Risk": 1,
    "Moderate Risk": 2,
    "High Risk": 3
  },

  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "seq_classif_dropout": 0.2,
  "transformers_version": "5.0.0",
  "vocab_size": 30522
}


